Rails/app/controllers/push_controller.rb

SELECT distinct regid FROM "devices"
---
  def broadcast
  	destinations = Device.select('distinct regid').map(&:regid)